# pandas Reference

In [1]:
import re
import pandas as pd
import numpy as np

In [2]:
data_path="/home/sfang/windows/gitlab/stanleysfang/code_reference/example_data/"

### read_csv

**Parameters**  
> names: list of column names; need header=0 if names is specified to replace header row in file  
sep: delimiter; default is ','  
dtype: dictionary of columns with their dtype (e.g. {"Name": "category", "Sex": "category", "Ticket": "category", "Embarked": "category"})  
skiprows: list of line numbers to skip (0-indexed) or number of lines to skip (int) at the start of file  
skip_blank_lines: if True, skip over blank lines rather than interpreting as NaN values; default is True

In [3]:
train = pd.read_csv(
    data_path + "kaggle_titanic_train.csv",
    header=0, names=['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'ParCh', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
    dtype={"Name": "category", "Sex": "category", "Ticket": "category", "Cabin": "category", "Embarked": "category"}
)

In [4]:
test = pd.read_csv(
    data_path + "kaggle_titanic_test.csv",
    header=0, names=['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'ParCh', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
    dtype={"Name": "category", "Sex": "category", "Ticket": "category", "Cabin": "category", "Embarked": "category"}
)

### to_csv

**Parameters**
> index: write row names; default is True  
header: write column names; default is True  
mode: default is write mode 'w'; append mode is 'a'  
na_rep: missing data representation; default is ''

In [5]:
train.loc[:, train.columns != "Survived"].to_csv(data_path + "kaggle_titanic_full.csv", index=False, mode='w')

In [6]:
test.to_csv(data_path + "kaggle_titanic_full.csv", index=False, header=False, mode='a')

### attributes

In [7]:
train.shape

(891, 12)

In [8]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'ParCh', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
train.index

RangeIndex(start=0, stop=891, step=1)

In [10]:
train.dtypes

PassengerId       int64
Survived          int64
Pclass            int64
Name           category
Sex            category
Age             float64
SibSp             int64
ParCh             int64
Ticket         category
Fare            float64
Cabin          category
Embarked       category
dtype: object

### astype

dtypes: int64, float64, category, bool, datetime64[ns]

In [11]:
train["Embarked"].astype("category")

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: category
Categories (3, object): [C, Q, S]

### statistics

In [12]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,ParCh,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
train["Age"].min()

0.42

In [14]:
train["Age"].max()

80.0

In [15]:
train["Age"].mean()

29.69911764705882

In [16]:
train["Age"].median()

28.0

In [17]:
train["Age"].mode()

0    24.0
dtype: float64

In [18]:
train["Age"].std()

14.526497332334042

### column inspection

In [19]:
train["Embarked"].unique()

[S, C, Q, NaN]
Categories (3, object): [S, C, Q]

In [20]:
train["Embarked"].nunique()

3

In [21]:
train["Embarked"].value_counts(ascending=True) # ascending defaults to False

Q     77
C    168
S    644
Name: Embarked, dtype: int64

In [22]:
train["Embarked"].shape[0]

891

In [23]:
train["Embarked"].isna().sum()

2

In [24]:
train["Embarked"].notna().sum()

889

In [25]:
train["Embarked"].count()

889

### missing value

In [26]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
ParCh            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
mv = train.isna().sum()[train.isna().sum() != 0]
mv_list = [(mv.index[i], mv[i]) for i in range(0, mv.shape[0])]

In [28]:
train[train["Embarked"].notna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [29]:
train["Age"].fillna(train["Age"].mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

### sort_values

**Parameters**
> na_position: {'first', 'last'}; default is 'last'

In [30]:
train.sort_values(by="Age", na_position="first")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S

In [31]:
train.sort_values(by=["Pclass", "Fare"], ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
...,...,...,...,...,...,...,...,...,...,...,...,...
378,379,0,3,"Betros, Mr. Tannous",male,20.0,0,0,2648,4.0125,NaN,C
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0000,NaN,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0000,NaN,S

### groupby

In [32]:
train[["Pclass", "Fare"]].groupby(["Pclass"]).mean()

             Fare
Pclass
1       84.154687
2       20.662183
3       13.675550

### isin

In [33]:
train[train["Ticket"].isin(["347082", "CA. 2343"])].sort_values(by=["Ticket", "Age"], ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.275,NaN,S
610,611,0,3,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",female,39.0,1,5,347082,31.275,NaN,S
542,543,0,3,"Andersson, Miss. Sigrid Elisabeth",female,11.0,4,2,347082,31.275,NaN,S
541,542,0,3,"Andersson, Miss. Ingeborg Constanzia",female,9.0,4,2,347082,31.275,NaN,S
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.275,NaN,S
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.275,NaN,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.275,NaN,S
159,160,0,3,"Sage, Master. Thomas Henry",male,NaN,8,2,CA. 2343,69.550,NaN,S
180,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.550,NaN,S
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.550,NaN,S
324,325,0,3,"Sage, Mr. George John Jr",male,NaN,8,2,CA. 2343,69.550,NaN,S
792,793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.550,NaN,S
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.550,NaN,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.550,NaN,S

### cap

In [34]:
upper_cap = np.percentile(train["Fare"], 95)

In [35]:
train.loc[train["Fare"] > upper_cap, "Fare"] = upper_cap

### row number

In [36]:
train = train.sort_values(by=["Fare", "Age", "PassengerId"], ascending=[False, False, True])

In [37]:
train["Fare_Rank"] = np.arange(train.shape[0], dtype="int64")+1

### qcut

**Parameters**
> q: number of quantiles or array of quantiles (e.g. [0, 0.25, 0.5, 0.75, 1])  
labels: labels for resulting bins; if False, return only integer indicators of the bins

In [38]:
pd.qcut(train["Fare"], 4, labels=False)+1

438    4
195    4
268    4
659    4
299    4
      ..
481    1
633    1
674    1
732    1
815    1
Name: Fare, Length: 891, dtype: int64

### cut

**Parameters**
> bins: number of equal-width bins in the range of x or array of bin edges  
labels: labels for resulting bins; if false, return only integer indicators of the bins

In [39]:
pd.cut(train["Age"], 5)

438    (48.168, 64.084]
195    (48.168, 64.084]
268    (48.168, 64.084]
659    (48.168, 64.084]
299    (48.168, 64.084]
             ...
481                 NaN
633                 NaN
674                 NaN
732                 NaN
815                 NaN
Name: Age, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.34, 16.336] < (16.336, 32.252] < (32.252, 48.168] < (48.168, 64.084] < (64.084, 80.0]]

### concat

**Parameters**
> axis: concat along rows if 0 and columns if 1; default is 0; make sure indices are reset when concat along columns  
sort: sort along the non-concat axis; default is True in old pandas version  
join: how to handle indices on other axis {'inner', 'outer'}; 'inner' only keeps matching indices while 'outer' keeps all indices; default is 'outer'

In [40]:
full = pd.concat([train, test], join='inner', sort=False)

In [41]:
pd.concat([pd.DataFrame(np.arange(full.shape[0], dtype="int64")+1, columns=["row_number"]), full.reset_index(drop=True)], axis=1, sort=False) # reset_index will insert old indices into column by default so include drop=True

,row_number,PassengerId,Pclass,Name,Sex,Age,SibSp,ParCh,Ticket,Fare,Cabin,Embarked
0,1,439,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,112.07915,C23 C25 C27,S
1,2,196,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,112.07915,B80,C
2,3,269,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,112.07915,C125,S
3,4,660,1,"Newell, Mr. Arthur Webster",male,58.0,0,2,35273,112.07915,D48,C
4,5,300,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,112.07915,B58 B60,C
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.05000,NaN,S
1305,1306,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.90000,C105,C
1306,1307,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.25000,NaN,S
1307,1308,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.05000,NaN,S
1308,1309,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.35830,NaN,C

### apply

In [42]:
title_re = re.compile('^.*, (.*?)\\..*$')
train['Title'] = train['Name'].apply(lambda x: title_re.search(x)[1])
train['Title'] = train['Title'].astype('category')
train[['Name', 'Title']]

                                                Name Title
438                                Fortune, Mr. Mark    Mr
195                             Lurette, Miss. Elise  Miss
268    Graham, Mrs. William Thompson (Edith Junkins)   Mrs
659                       Newell, Mr. Arthur Webster    Mr
299  Baxter, Mrs. James (Helene DeLaudeniere Chaput)   Mrs
..                                               ...   ...
481                 Frost, Mr. Anthony Wood "Archie"    Mr
633                    Parr, Mr. William Henry Marsh    Mr
674                       Watson, Mr. Ennis Hastings    Mr
732                             Knight, Mr. Robert J    Mr
815                                 Fry, Mr. Richard    Mr

[891 rows x 2 columns]

### loc

Use loc when subscripting both rows and columns. It is not needed when subscripting only one.

In [43]:
adult_title = ['Mr', 'Mrs', 'Dr', 'Rev', 'Col', 'Major', 'Sir', 'Don', 'Dona', 'Mme', 'Jonkheer', 'Lady', 'Capt', 'the Countess']

train.loc[train['Title'].isin(adult_title) & (train['Sex'] == 'male'), 'Title_cleaned'] = 'Mr'
train.loc[train['Title'].isin(adult_title) & train['Sex'].isin(['female']), 'Title_cleaned'] = 'Mrs'
train.loc[train['Title'].isin(['Miss', 'Ms', 'Mlle']), 'Title_cleaned'] = 'Miss'
train.loc[train['Title'] == 'Master', 'Title_cleaned'] = 'Master'